In [1]:
import pandas as pd

##### Creating dataframes

In [ ]:
data = {'PoductName': ['Product A', 'Product B', 'Product C', 'Product D'], 'ProductPrice':[2250, 16600, 12500, 5000]}
ProductId = ['A', 'B', 'C', 'D']
df1 = pd.DataFrame(data, index = ProductId)
df1

  PoductName  ProductPrice
A  Product A          2250
B  Product B         16600
C  Product C         12500
D  Product D          5000

In [ ]:
### Creating Data Frames from Pandas Series
ser_products = pd.Series(['Product A', 'Product B', 'Product C', 'Product D'])
ser_prices = pd.Series([22344, 34500, 21000, 45000])

data = {'ProductName': ser_products, 'ProductPrice':ser_prices}
df2 = pd.DataFrame(data)
df2

  ProductName  ProductPrice
0   Product A         22344
1   Product B         34500
2   Product C         21000
3   Product D         45000

In [10]:
df3 = pd.DataFrame(data = [['Product A', 22250], ['Product B', 16600], ['Product C', 12500]],
                    columns = ['ProductName', 'ProductPrice'],
                    index = ['A', 'B', 'C'])
df3

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [11]:
df3.shape

(3, 2)

In [12]:
data = pd.read_csv('Lending-company.csv')
lending_data = data.copy()
lending_data.head()

,LoanID,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
0,1,LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
1,2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
2,3,LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
3,4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
4,5,LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [13]:
lending_data.tail()

,LoanID,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
1038,1039,LoanID_1039,Product B,Male,Location 73,Region 6,17300.0,29/12/2018,2200,45,365,3251,4743,16617,Finished Payment
1039,1040,LoanID_1040,Product A,Male,Location 82,Region 1,NaN,28/03/2018,2200,45,365,4090,5582,16617,Finished Payment
1040,1041,LoanID_1041,Product A,NotSpecified,Location 11,Region 4,17300.0,26/04/2018,2200,45,365,4051,5143,16617,Finished Payment
1041,1042,LoanID_1042,Product B,Female,Location 26,Region 6,16300.0,25/10/2016,1000,45,365,1930,3462,15617,Finished Payment
1042,1043,LoanID_1043,Product A,NotSpecified,Location 94,Region 6,17300.0,15/05/2019,2200,45,365,4451,4743,16617,Finished Payment

In [28]:
lending_data.describe()

,LoanID,TotalPrice,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360
count,1043.000000,1018.000000,1043.000000,1043.000000,1043.0,1043.000000,1043.000000,1043.000000
mean,522.000000,19562.843811,2528.092042,50.834132,365.0,3901.857143,5214.393097,17122.131352
std,301.232468,5955.588065,1504.467724,11.567390,0.0,2537.597667,2850.327133,5910.916736
min,1.000000,13475.000000,1000.000000,30.000000,365.0,-2770.000000,-2945.000000,650.000000
25%,261.500000,16300.000000,2200.000000,45.000000,365.0,2840.500000,3822.000000,15560.500000
50%,522.000000,17600.000000,2200.000000,45.000000,365.0,3420.000000,4742.000000,16617.000000
75%,782.500000,20950.000000,2200.000000,55.000000,365.0,5075.500000,6393.000000,19977.500000
max,1043.000000,70225.000000,8000.000000,150.000000,365.0,18851.000000,22143.000000,65001.000000

##### Data Selection in pandas frames

In [16]:
lending_data['Deposit']

0       2200
1       2200
2       1000
3       2200
4       2200
        ...
1038    2200
1039    2200
1040    2200
1041    1000
1042    2200
Name: Deposit, Length: 1043, dtype: int64

In [17]:
prod_loc = ['Location', 'Product']
lending_data[prod_loc].head()

      Location    Product
0   Location 3  Product B
1   Location 6  Product D
2   Location 8  Product B
3  Location 26  Product A
4  Location 34  Product B

##### Using .iloc in Pandas Data frame.

In [21]:
lending_data.iloc[1,-1]

'Active'

In [20]:
lending_data.shape

(1043, 15)

In [29]:
lending_data['Location'].min()

'Location 1'